RIET/src/Reports/РегистрУчетаВнереализационныхРасходовТекущегоПериода/РегистрУчетаВнереализационныхРасходовТекущегоПериода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегистрУчетаВнереализационныхРасходовТекущегоПериода</name>
  <comment>(регл)</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРасходов</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
</mdclass:Report>

RIET/src/AccountingRegisters/Налоговый/Налоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Налоговый</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Налоговый</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчетаПоПБУ18</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

RIET/src/Enums/ВидыПрочихДоходовИРасходов/ВидыПрочихДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрочихДоходовИРасходов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ВозмещениеУбытковКПолучениюУплате</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДолевоеУчастиеВИностранныхОрганизациях</name>
  </enumValues>
  <enumValues>
    <name>ДолевоеУчастиеВРоссийскихОрганизациях</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыНеУчитываемыеВЦеляхНалогообложения</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделок</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделокОР</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСБезвозмезднымПолучениемИмущества</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСЛиквидациейОсновныхСредств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСоСдачейИмуществаВАренду</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейИмущественныхПравКромеПраваТребования</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейИмущественныхПравПоОбъектамОбслуживающихПроизводств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейНематериальныхАктивов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейОсновныхСредств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияДоНаступленияСрокаПлатежа</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияКакОказанияФинансовыхУслуг</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияПослеНаступленияСрокаПлатежа</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПрочегоИмущества</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейЦенныхБумаг</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСУчастиемВДругихОрганизациях</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>КурсовыеРазницы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДСПоСписаннойКредиторскойЗадолженности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОтчисленияВОценочныеРезервы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПремияПокупателю</name>
    <comment>Премия, выплаченная покупателю</comment>
  </enumValues>
  <enumValues>
    <name>ПрибыльУбытокПрошлыхЛет</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыКПолучениюУплате</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыНачисленныеПоСт269</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоГосударственнымЦеннымБумагам</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнереализационныеДоходыРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперационныеДоходыРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РазницаМеждуПервоначальнойИНоминальнойСтоимостьюПоДолговымЦеннымБумагам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыНаУслугиБанков</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыОтСниженияСтоимостиАктивов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеДебиторскойКредиторскойЗадолженности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ШтрафыПениНеустойкиКПолучениюУплате</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ВидыУчетаПоПБУ18/ВидыУчетаПоПБУ18.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчетаПоПБУ18</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>НУ</name>
    <comment>Налоговый учет</comment>
  </enumValues>
  <enumValues>
    <name>ПР</name>
    <comment>Учет постоянных разниц</comment>
  </enumValues>
  <enumValues>
    <name>ВР</name>
    <comment>Учет временных разниц</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Reports/РегистрУчетаВнереализационныхРасходовТекущегоПериода/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт

	ДокументРезультат.Очистить();

	Макет = ПолучитьМакет("Отчет");

	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");

	ОбластьЗаголовок.Параметры.НачалоПериода       = Формат(ДатаНач, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.КонецПериода        = Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное;
	ОбластьЗаголовок.Параметры.ИННОрганизации      = "" + Организация.ИНН + " / " + Организация.КПП;
	ДокументРезультат.Вывести(ОбластьЗаголовок);

	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;

	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;
    	
	ФормированиеРезервовПоСомнительнымДолгам = Новый Массив;
	ФормированиеРезервовПоСомнительнымДолгам.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы);
	ФормированиеРезервовПоСомнительнымДолгам.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ОтчисленияВОценочныеРезервы);
	ФормированиеРезервовПоСомнительнымДолгам.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.СписаниеДебиторскойКредиторскойЗадолженности);
		
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ПроцентыПоДолговымОбязательствам", Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыКПолучениюУплате);
	Запрос.УстановитьПараметр("ФормированиеРезервовПоСомнительнымДолгам", ФормированиеРезервовПоСомнительнымДолгам);
	Запрос.УстановитьПараметр("НДСПоСписаннойКредиторскойЗадолженности", Перечисления.ВидыПрочихДоходовИРасходов.НДСПоСписаннойКредиторскойЗадолженности);
	Запрос.УстановитьПараметр("ОперацииСФинансовымиИнструментамиСрочныхСделокОР", Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделокОР);
	Запрос.УстановитьПараметр("ОперацииСФинансовымиИнструментамиСрочныхСделок", Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделок);
	Запрос.УстановитьПараметр("СодержаниеИмуществаПереданногоВАренду", Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСоСдачейИмуществаВАренду);
	Запрос.УстановитьПараметр("ЛиквидацияВыводимыхИзЭксплуатацииОсновныхСредств", Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСЛиквидациейОсновныхСредств);
	Запрос.УстановитьПараметр("УбыткиПрошлыхЛет", Перечисления.ВидыПрочихДоходовИРасходов.ПрибыльУбытокПрошлыхЛет);
	Запрос.УстановитьПараметр("СуммыБезнадежныхДолгов", Перечисления.ВидыПрочихДоходовИРасходов.СписаниеДебиторскойКредиторскойЗадолженности);
	Запрос.УстановитьПараметр("УслугиБанков", Перечисления.ВидыПрочихДоходовИРасходов.РасходыНаУслугиБанков);
	Запрос.УстановитьПараметр("КурсовыеРазницы", Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницы);
	Запрос.УстановитьПараметр("Штрафы", Перечисления.ВидыПрочихДоходовИРасходов.ВозмещениеУбытковКПолучениюУплате);
	Запрос.УстановитьПараметр("ДатаНач",      НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон",      КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Счет91_02_6",  ПланыСчетов.Налоговый.ВнереализационныеРасходы);
	Запрос.УстановитьПараметр("Счет96",       ПланыСчетов.Налоговый.РезервыПредстоящихРасходов);
	Запрос.УстановитьПараметр("ВидУчета",     Перечисления.ВидыУчетаПоПБУ18.НУ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НалоговыйОборотыДтКт.Период КАК ДатаОперации,
	|	НалоговыйОборотыДтКт.Регистратор КАК Расшифровка,
	|	ВЫБОР 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &ПроцентыПоДолговымОбязательствам ТОГДА 
	|			""Проценты по долговым обязательствам"" 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов В ИЕРАРХИИ (&ФормированиеРезервовПоСомнительнымДолгам) И НалоговыйОборотыДтКт.СчетКт = &Счет96 ТОГДА 
	|			""Формирование резервов по сомнительным долгам"" 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &НДСПоСписаннойКредиторскойЗадолженности ТОГДА 
	|			""НДС по списанной кредиторской задолженности"" 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &ОперацииСФинансовымиИнструментамиСрочныхСделокОР ТОГДА 
	|			""Доходы расходы по операциям с финансовыми инструментами срочных сделок, обращающимися на организованном рынке"" 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &ОперацииСФинансовымиИнструментамиСрочныхСделок ТОГДА 
	|			""Доходы расходы по операциям с финансовыми инструментами срочных сделок, не обращающимися на организованном рынке"" 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &СодержаниеИмуществаПереданногоВАренду ТОГДА 
	|			""Содержание имущества, переданного в аренду"" 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &ЛиквидацияВыводимыхИзЭксплуатацииОсновныхСредств ТОГДА 
	|			""Ликвидация выводимых из эксплуатации основных средств"" 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &УбыткиПрошлыхЛет ТОГДА 
	|			""Убытки прошлых лет"" 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &СуммыБезнадежныхДолгов ТОГДА 
	|			""Суммы безнадежных долгов, не покрытые за счет средств резерва"" 
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &УслугиБанков ТОГДА 
	|			""Услуги банков""
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &КурсовыеРазницы ТОГДА 
	|			""Курсовые разницы""
	|		КОГДА НалоговыйОборотыДтКт.СубконтоДт1.ВидПрочихДоходовИРасходов = &Штрафы ТОГДА 
	|			""Штрафы, пени, неустойки""
	|		ИНАЧЕ 
	|			""Прочие внереализационные расходы"" 
	|	КОНЕЦ КАК ВидЗатрат,
	|	НалоговыйОборотыДтКт.СуммаОборот КАК Сумма,
	|	Налоговый.Содержание,
	|	Налоговый.НомерСтроки КАК НомерПроводки
	|ИЗ
	|	РегистрБухгалтерии.Налоговый.ОборотыДтКт(&ДатаНач,
	|&ДатаКон,
	|Запись,
	|СчетДт = &Счет91_02_6,
	|,
	|,
	|, 
	|Организация = &Организация И ВидУчетаДт = &ВидУчета И СубконтоДт1.ПринятиеКналоговомуУчету) КАК НалоговыйОборотыДтКт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Налоговый КАК Налоговый
	|		ПО НалоговыйОборотыДтКт.Регистратор = Налоговый.Регистратор И НалоговыйОборотыДтКт.НомерСтроки = Налоговый.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОперации,
	|	НомерПроводки
	|";
	Результат = Запрос.Выполнить();

	ТаблицаОтладки = Новый ТаблицаЗначений;
	ТаблицаОтладки = Результат.Выгрузить();
	
	ОбластьПодвал        = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока        = Макет.ПолучитьОбласть("Строка");

	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);

	Выборка = Результат.Выбрать();

	СписокВидов = Новый СписокЗначений();
	Для каждого ЭлементСписка из ВидыРасходов Цикл
		Если ЭлементСписка.Пометка Тогда
			СписокВидов.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
    ИтогоСумма = 0;
	Пока Выборка.Следующий() Цикл

		Если СписокВидов.НайтиПоЗначению(Выборка.ВидЗатрат) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ОбластьСтрока.Параметры.ДатаОперации        = Выборка.ДатаОперации;
		ОбластьСтрока.Параметры.СтатьяРасхода       = Выборка.ВидЗатрат;
		ОбластьСтрока.Параметры.ОбъектУчета			= Выборка.Содержание;
		ОбластьСтрока.Параметры.Сумма               = Выборка.Сумма;
		ИтогоСумма = ИтогоСумма + Выборка.Сумма;
		ОбластьСтрока.Параметры.Расшифровка         = Выборка.Расшифровка;

		ДокументРезультат.Вывести(ОбластьСтрока);

	КонецЦикла;

	СтруктураЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ДатаКон);
	ОбластьПодвал.Параметры.ОтветственныйЗаРегистры = СтруктураЛиц.ОтветственныйЗаРегистры;
	ОбластьПодвал.Параметры.ИтогоСумма = ИтогоСумма;
	ДокументРезультат.Вывести(ОбластьПодвал);

КонецПроцедуры // СформироватьОтчет

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП           = Новый НастройкаПериода;

#КонецЕсли
